examples/wireDrawing/setup_openfoam/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    dieWall
    {
        type            zeroGradient;
    }


    outlet
    {
         type            fixedValue;
         value		 uniform 0;
    }

    inlet
    {
        type              fixedValue;
        value		  uniform 0;
    }

    upWire
    {
       type            zeroGradient;
    }

    deformWire
    {
       type            zeroGradient;
    }

    finalWire
    {
       type            zeroGradient;
    }

    back
    {
        type            wedge;
    }

    front
    {
        type            wedge;
    }
}

// ************************************************************************* //
